package com.epam.streamdp.three.enums;
/**
 *
 * ЗАКОН РЕСПУБЛИКИ БЕЛАРУСЬ 21 июня 2002 г.N110-З О ДРАГОЦЕННЫХ МЕТАЛЛАХ И ДРАГОЦЕННЫХ КАМНЯХ
 * Статья1.
 * Драгоценные камни - природные алмазы, изумруды, рубины, сапфиры, александриты, а
 * так же природный жемчуг в сыром (естественном) и обработанном виде.  К драгоценным камням приравниваются уникальные
 * янтарные образования;
 *
 * Уникальные янтарные образования – янтарные образования массой свыше 1000 граммов, разнообразной, фантазийной формы,
 * относительно монолитные по своей структуре (не менее 80 процентов), не содержащие сквозных раковин,
 * визуальных трещин, угрожающих целостности образца, разнообразной цветовой гаммы,
 * возможно с хорошо сохранившимися включениями флоры и фауны размерами более 10 миллиметров.
 *
*/

public enum GemsNames {
    DIAMOND, EMERALD, RUBY, SAPPHIRE, ALEXANDRITE, PEARLS, AMBER
}